Autodesk.Revit.UI.PostableCommand.Optimize
Access energy and environmental performance data in Insight.

Autodesk.Revit.UI.PostableCommand.Generate
Creates the energy analytical model and generates design options and potential performance outcomes with Insight.